In [1]:
import pandas as pd
lst = ['Geeks', 'For', 'Geeks', 'is', 'portal', 'for', 'Geeks']
lst2 = [11, 22, 33, 44, 55, 66, 77]
df = pd.DataFrame(list(zip(lst, lst2)),columns =['Name', 'val'])
df

     Name  val
0   Geeks   11
1     For   22
2   Geeks   33
3      is   44
4  portal   55
5     for   66
6   Geeks   77

In [3]:
import pandas as pd
lst = [['tom', 25], ['krish', 30]]
df = pd.DataFrame(lst, columns =['Name', 'Age'])
df

    Name  Age
0    tom   25
1  krish   30

In [4]:
import pandas as pd
nme = ["aparna", "pankaj", "sudhir", "Geeku"]
deg = ["MBA", "BCA", "M.Tech", "MBA"]
scr = [90, 40, 80, 98]
dict = {'name': nme, 'degree': deg, 'score': scr}
df = pd.DataFrame(dict)
df

     name  degree  score
0  aparna     MBA     90
1  pankaj     BCA     40
2  sudhir  M.Tech     80
3   Geeku     MBA     98

In [11]:
ini_string = 'abcdef'
c = "b"
print ("initial_string : ", ini_string, "\ncharacter_to_find : ", c)
res = None
for i in range(0, len(ini_string)):
    if ini_string[i] == c:
        res = i + 1
        break
if res == None:
    print ("No such character available in string")
else:
    print ("Character {} is present at {}".format(c, str(res)))

initial_string :  abcdef
character_to_find :  b
Character b is present at 2

In [1]:
from pandas import *

x=Series([2,4,6,8])
print(x)

y=x.tolist()

print(y)

print(Series(y))


s=Series([1,2,3,4],index=["1st","2nd","3rd","4th"])
print(s)
s=s.reindex(index=["3rd","1st","4th","2nd"])

print(s)

0    2
1    4
2    6
3    8
dtype: int64
[2, 4, 6, 8]
0    2
1    4
2    6
3    8
dtype: int64
1st    1
2nd    2
3rd    3
4th    4
dtype: int64
3rd    3
1st    1
4th    4
2nd    2
dtype: int64